// В першу чергу масив має бути відсортований, далі з кожною ітерацією кількість аргументів зменшується в два рази
// log2n
//1) маємо масив із 128 відсорторованих значень яке беде максимальна кількість ітерацій 
// log2 128
//2) Якщо кількість аргументів збіьшиться в 2 рази як зміниться кількість ітерацій 
// кількісь ітерацій збільшиться на одну 

// О велике - пояснює швидкість роботи алгоритму 

// 3)Відома фамілія потрібно найти номер в телефоній книзі 
// log2n
// 4)Порахувати всі телефоні номери в книзі 
// log n

// Час виконання алгоритма описується ростом кількості операцій 
